Обработки/DataProcessors/_ВыгрузкаДанныхБлагосостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаДанныхБлагосостояние</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПустоеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ВыгрузкаДанныхБлагосостояние/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация		= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	Объект.ПустоеЗначение	= "#";	
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение(Объект.КаталогДанных + ?(Прав(Объект.КаталогДанных, 1) = "\", "", "\"));

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьДанные(Команда)
	
	ВыгрузитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные()

	ШаблонИмениФайла	= СформироватьШаблонИмениФайла(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Период);			
	ИмяФайла			= Объект.КаталогДанных + "\" + СтрЗаменить(ШаблонИмениФайла, "_ТегДанных_", "_") + ".xml";
	
	Результат = ВыгрузитьДанныеНаСервере();		
	
	Если Результат <> Неопределено Тогда
		Результат.Записать(ИмяФайла);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл сохранён: " + ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДанныеНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ИмяВременногоФайла = ТекущийОбъект.ВыгрузитьДанные();
	Если ИмяВременногоФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый ДвоичныеДанные(ИмяВременногоФайла); 
	
	УдалитьФайлы(ИмяВременногоФайла);	
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьШаблонИмениФайла(Организация, СчетДоверительногоУправления, Период)
	
	ШаблонИмениФайла = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ((ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент.Ссылка КАК Справочник.ЮрФизЛица)) = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)";

	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаОкончания"				, Период.ДатаОкончания);

	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаОрганизации = Пакет[0].Выбрать();
	Если ВыборкаОрганизации.Следующий() Тогда
		ШаблонИмениФайла = ШаблонИмениФайла + ВыборкаОрганизации.КраткоеНаименованиеПоУставу + "_";
	КонецЕсли;
	
	ВыборкаСчетовДУ = Пакет[1].Выбрать();
	Если ВыборкаСчетовДУ.Следующий() Тогда
		ШаблонИмениФайла = ШаблонИмениФайла + ВыборкаСчетовДУ.КраткоеНаименованиеПоУставу + "_";
	КонецЕсли;
	
	ШаблонИмениФайла = ШаблонИмениФайла + "ТегДанных_";
	ШаблонИмениФайла = ШаблонИмениФайла + СчетДоверительногоУправления.НомерДоговора + "_";
	ШаблонИмениФайла = ШаблонИмениФайла + Формат(Период.ДатаНачала, "ДФ=dd-MM-yyyy") + "_";
	ШаблонИмениФайла = ШаблонИмениФайла + Формат(Период.ДатаОкончания, "ДФ=dd-MM-yyyy");
	
	ШаблонИмениФайла = СтрЗаменить(ШаблонИмениФайла, "/", "_");
	ШаблонИмениФайла = СтрЗаменить(ШаблонИмениФайла, """", "");
	ШаблонИмениФайла = СтрЗаменить(ШаблонИмениФайла, " ", "_");
	
	Возврат ШаблонИмениФайла;	
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольРасчетаМНО(Команда)
	КонтрольРасчетаМНОНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрольРасчетаМНОНаСервере()
	
	РеквизитФормыВЗначение("Объект").КонтрольРасчетаМНО();
	
КонецПроцедуры
